12/data/attachments/e92e39620eac4762.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_30227e46-c1fd-41dc-9412-4d1f0c3bbc5f</nif:username>
            <nif:friendToBeAdded>Michael_here_Friend_11415_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>